package net.osandman.ai.sandbox.config;

public interface Templates {

    String CONTEXT_TEMPLATE = """
        {query}
        
        Контекстная информация приведена ниже, окружена символами ---------------------
        
        ---------------------
        {question_answer_context}
        ---------------------
        
        Используя предоставленный контекст и историю диалога (без привлечения внешних знаний),
        ответь на запрос пользователя. Если ответа нет в контексте, честно сообщи,
        что не можешь ответить на вопрос.
        """;
}
